# AutoGlazingFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..AutoGlazingFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failure in Auto-Glazing region computation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AutoGlazingFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AutoGlazingFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AutoGlazingFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace